vermashobhit1994/Embedded-System-Software/IoT_Based_Health_Monitoring_System/stm32f44xx_driver_Layer1/Src/stm32f44xx_i2c_driver.c
/*
 * stm32f446xx_i2c_driver.c
 *
 *  Created on: 18-Sep-2020
 *      Author: vermas
 */



#include"stm32f44xx_i2c_driver.h"



/*******************************************************************************************
 ****************************API's definitions supported by this driver*********************************/

/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_PeriClock_Ctrl
 * @brief                        : Function to Control the peripheral clock of I2C.
 * @param[in]                    : Base address of the I2C Register definition structure .
 * @param[in]                    : Bit to enable or disable.
 * @return                       : None
 * Special Note                  : None
 */

void I2C_PeriClock_Ctrl(I2C_RegDef_t *pI2Cx,uint8_t ENOrDI)//enable and disable the peripheral clock
{
	//enable the clock for I2C1, I2C2, I2C3
	if(ENOrDI == ENABLE)
	{
		if(pI2Cx == I2C1)
			I2C1_PERI_CLK_EN();
		else if(pI2Cx == I2C2)
			I2C2_PERI_CLK_EN();
		else if(pI2Cx == I2C3)
			I2C3_PERI_CLK_EN();

	}
	//disable the clock I2C1, I2C2, I2C3
	else
	{
		if(pI2Cx == I2C1)
			I2C1_PERI_CLK_DI();
		else if(pI2Cx == I2C2)
			I2C2_PERI_CLK_DI();
		else if(pI2Cx == I2C3)
			I2C3_PERI_CLK_DI();

	}
}






/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_Init
 * @brief                        : Function to initialize the parameters given by user.
 * @param[in]                    : Base address of the I2C Handle structure .
 * @return                       : None
 * Special Note                  : Refer to Page 765 in RM0390 reference manual.
 *                                 Here the I2C Init must be called first and then
 *                                 Peripheral must be enable
 */
void I2C_Init(I2C_Handle_t *pI2CHandle)
{
	uint32_t tempreg = 0;//temporary register to store the data

	//enable the I2C Peripheral Clock
	I2C_PeriClock_Ctrl(pI2CHandle -> pI2Cx,ENABLE);

	/******************* step 1: enable the ACK***************************************/
	 /* done since input by user*/
		tempreg = 0;
		tempreg |= ( (pI2CHandle -> I2C_Config.I2C_ACKCtrl) << I2C_CR1_ACK);
	    (pI2CHandle ->pI2Cx->I2C_CR[0]) |= tempreg;//put the value in I2C_CR1 Ack field.
         //(*(pI2CHandle ->pI2Cx->I2C_CR[0])) |= tempreg;

	/*****************Step 2: configure the FREQ fields of I2C_CR2 Register  ********/
	/* This is done to set the APB1 frequency value for I2C peripheral*/
	tempreg = 0;
	tempreg |= RCC_GetPCLK1Value()/1000000U;//to get only 16 instead of 16000000
	//to check only 5 LSB Bits and store value in I2C_CR2 Register.
	pI2CHandle -> pI2Cx -> I2C_CR[1] |= (tempreg & 0x3F);






	/******************* Step3 : Select the slave address if device is slave ***********************************/
	tempreg = 0;
	//getting the slave address as entered by user.
	tempreg |= pI2CHandle -> I2C_Config.I2C_DeviceAddress << 1;//for excluding the ADD0 bit
	tempreg |= (1<<14);//As specified by reference Manual

	//copy the value in ADD field of I2C_OAR1 Register
	//putting the 1 in 14th bit of I2C_OAR1 Register i.e reserved bit.
	pI2CHandle ->pI2Cx->I2C_OAR[0] |= (tempreg );

	/******************* Step4 : Select the CCR Value according to mode ***********************************/
    /* This is used to produce the clock of I2C peripheral */
	//CCR Calculations
	uint16_t ccr_value = 0;//I2C_CCR Register is of 16 bit
	tempreg = 0;

	//Step a : configure CCR value for the standard mode i.e 100 KHz
	if(pI2CHandle -> I2C_Config.I2C_SCLSpeed == I2C_SCL_SPEED_ST_MODE)
	{
		//get the ccr value using the pclk1 and i2cscl clock.
		ccr_value = RCC_GetPCLK1Value() / (2 * pI2CHandle -> I2C_Config.I2C_SCLSpeed);
		tempreg |= (ccr_value & 0xFFF);//check only LSB 12 bits and store in tempreg.
	}

	//Step b: configure CCR value for the fast mode i.e > 100KHz
	else
	{
		//step 1. select the mode as fast .
		tempreg |= (1 << I2C_CCR_F_S);

		//step2 select duty cycle as entered by user.
		tempreg |= ( (pI2CHandle -> I2C_Config.I2C_FMDUTYCYCL) << I2C_CCR_DUTY);

		//check the duty cycle value = 0 i.e 2
		if(pI2CHandle -> I2C_Config.I2C_FMDUTYCYCL == I2C_FM_DUTY2)
			ccr_value = RCC_GetPCLK1Value()/ (3 * pI2CHandle -> I2C_Config.I2C_SCLSpeed);
		else
			ccr_value = RCC_GetPCLK1Value()/ (25 * pI2CHandle -> I2C_Config.I2C_SCLSpeed);

		//put the value from ccr_value in tempreg where only 12 bits are taken.
		tempreg |= ccr_value & 0xFFF;

	}
	//put the value in I2C_CCR Register from tempreg. Must be done when the I2C Peripheral is disabled
	pI2CHandle -> pI2Cx -> I2C_CCR |= tempreg;


	/************ Step5: Configure the Rise time i.e I2C_TRISE Register******************/
	/* Must be configured when the peripheral is disable*/
	//to store the rise time for both standard and fast mode

	uint8_t Trise = 0;

	//if mode is standard mode that means the Trise max = 1000ns
	//taken from i2c bus specification manual.
	if(pI2CHandle -> I2C_Config.I2C_SCLSpeed <= I2C_SCL_SPEED_ST_MODE)
	{

		//(1000 * 10 ^ (-9)) / (TPCLK1) -> FPCLK1 * 10^(-6) -> FPCLK1 / (10^(6))
		//Here 1000 * 10 ^(-9) -> Trise time
		Trise = (RCC_GetPCLK1Value() / 1000000U) + 1;

	}
	//if mode is fast mode then rise time = 300ns
	else
	{
		//(300 * 10 ^ (-9)) / (TPCLK1) -> FPCLK1 * 300 * 10^(-9) -> FPCLK1 / ( 300 * (10^(9)) )
		//Here 300 * 10 ^(-9) -> Trise time
		Trise = ( (RCC_GetPCLK1Value() * 300) / 1000000000U ) + 1;
	}
    //put the value in I2C_TRISE Register.
	pI2CHandle -> pI2Cx ->I2C_TRISE |= (Trise & 0x3F);//masking i.e filtering  the 5 lowest bits only.

	//After that enable the peripheral
	//After that set the start bit to enter into master mode else enter into slave mode
}




/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_DeInit
 * @brief                        : Function to deinitialize /reset peripheral of I2C.
 * @param[in]                    : Base address of the I2C Handle structure .
 * @return                       : None
 * Special Note                  : None
 */
void I2C_DeInit(I2C_Handle_t *pI2CHandle) //Deinitialize the I2C
{
	if(pI2CHandle -> pI2Cx == I2C1)
		I2C1_REG_RESET();
	else if(pI2CHandle -> pI2Cx == I2C2)
		I2C2_REG_RESET();
	else if(pI2CHandle -> pI2Cx == I2C3)
		I2C3_REG_RESET();

