vermashobhit1994/Embedded-System-Software/IoT_Based_Health_Monitoring_System/stm32f44xx_driver_Layer1/Src/stm32f44xx_i2c_driver.c
}

/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_GenerateStartCondition
 * @brief                        : Function to generate repeated start condition I2C.
 * @param[in]                    : Base address of the I2C Register structure .
 * @return                       : None
 * Special Note                  : This is private to this file.
 */

void I2C_GenerateStartCondition(I2C_RegDef_t *pI2Cx)
{
	pI2Cx -> I2C_CR[0] |= ( 1 << I2C_CR1_START);//set the START Bit of I2C_CR1 to activate repeated start.
}

/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_ExecuteAddressPhase
 * @brief                        : Function to send 7 bit slave address + read/write bit.
 * @param[in1]                   : Base address of the I2C Register structure .
 * @param[in2]                   : Read or Write bit
 * @return                       : None
 * Special Note                  : Here the slave address is first left shfited to add the R/W bit
 */
static void I2C_ExecuteAddressPhase(I2C_RegDef_t  *pI2Cx,uint8_t SlaveAddr,uint8_t R_W_Bit)
{
	//SlaveAddr = 0x27;
	SlaveAddr <<= 1;//make space for r/w bit in LSB position.

	//if the Master wants to write/Transmit Data then put the LSB = 0
	if(R_W_Bit == 0)
		//clear the 0th bit
		SlaveAddr &= ~(1);
	//else set the last bit to read/receive data by master
	else
		SlaveAddr |= (1);//slave address is slaveaddr+r/w(1)


	//put the value in DR Register
	pI2Cx ->I2C_DR = SlaveAddr;
}

/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_ClearADDRFlagInterrupt
 * @brief                        : Function to clear ADDR flag after address phase is done
 * @param[in]                    : Base address of the I2C Handle structure .
 * @return                       : None
 * Special Note                  : Done in interrupt mode.
 */
static void I2C_ClearADDRFlagInterrupt(I2C_Handle_t *pI2CHandle)
{
	//check the device is in master mode
	if(pI2CHandle -> pI2Cx -> I2C_SR[1] & (1 << I2C_SR2_MSL))
	{
		//checking the reception busy state for received data
		if(pI2CHandle -> TxRxState == I2C_BUSY_IN_RX)
		{
			//if length of received data is 1
			if(pI2CHandle -> RxLen == 1)
			{
				//1. first disable the ACK
				(pI2CHandle -> pI2Cx ->I2C_CR[0]) &= ~(1 << I2C_CR1_ACK);

				//2. Clear ADDR flag
				//read the dummy data from I2C_SR1
				uint16_t dummyRead = pI2CHandle -> pI2Cx -> I2C_SR[0];//read SR1 register
				dummyRead = pI2CHandle -> pI2Cx -> I2C_SR[1];//read SR2 Register
				(void )dummyRead;//avoid warning of unused variable
			}

			//check the transmitted data
			else
			{
				//Clear ADDR flag
				//read the dummy data from I2C_SR1
				uint16_t dummyRead = pI2CHandle -> pI2Cx -> I2C_SR[0];//read SR1 register
				dummyRead = pI2CHandle -> pI2Cx -> I2C_SR[1];//read SR2 Register
				(void )dummyRead;//avoid warning of unused variable
			}
		}


	}

	//check the device is in slave mode
	else
	{
		//Clear ADDR flag
		//read the dummy data from I2C_SR1
		uint16_t dummyRead = pI2CHandle -> pI2Cx -> I2C_SR[0];//read SR1 register
		dummyRead = pI2CHandle -> pI2Cx -> I2C_SR[1];//read SR2 Register
		(void )dummyRead;//avoid warning of unused variable
	}


}

/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_ClearADDRFlag
 * @brief                        : Function to clear ADDR flag after address phase is done
 * @param[in]                    : Base address of the I2C register structure .
 * @return                       : None
 * Special Note                  : None
 */
static void I2C_ClearADDRFlag(I2C_RegDef_t *pI2C)
{
	//Clear ADDR flag
	//read the dummy data from I2C_SR1
	uint16_t dummyRead = pI2C -> I2C_SR[0];//read SR1 register
	dummyRead = pI2C -> I2C_SR[1];//read SR2 Register
	(void )dummyRead;//avoid warning of unused variable
}


/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_GenerateStopCondition
 * @brief                        : Generate the stop condition by setting the STOP bit.
 * @param[in]                    : Base address of the I2C register structure .
 * @return                       : None
 * Special Note                  : None
 */
void I2C_GenerateStopCondition(I2C_RegDef_t *pI2Cx)
{
	pI2Cx -> I2C_CR[0] |= ( 1 << I2C_CR1_STOP);//set the STOP Bit of I2C_SR1 Register.
}


/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_GetFlagStatus
 * @brief                        : Function to Read the bit of I2C status Register i.e either I2C_SR1 or I2C_SR2
 * @param[in]                    : Base address of the I2C Handle structure .
 *  @param[in]                   : Flag of status register.
 * @return                       : Status of bit , 0 -> reset, 1 -> set
 * Special Note                  : None
 */

uint8_t I2C_GetFlagStatus(I2C_RegDef_t *pI2Cx,uint32_t FlagName)
{
	/*test the FlagName  in I2C_SR1 Register.
	If the value is set return 1(FLAG_SET) */
	if((pI2Cx -> I2C_SR[0]) & FlagName)
		return I2C_FLAG_SET;
	   //else return 0(FLAG_RESET)
	return I2C_FLAG_RESET;
}



/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_MasterSendData
 * @brief                        : Function to send the data to slave byte by byte.
 * @param[in1]                   : Base address of the I2C Handle structure .
 * @param[in2]                   : Pointer to user buffer.
 * @param[in3]                   : length of user buffer.
 * @param[in4]                   : 7 bit slave address.
 * @param[in5]                   : Control the stop condition generation.
 * @return                       : None
 * Special Note                  : check Fig276 in RM0390 on Page 768
 */
Error_Status I2C_MasterSendData(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer,uint32_t len,uint8_t SlaveAddr ,uint8_t RepeatStartConditionCtrl)
{
	uint32_t timeout = I2C_MASTER_TIMOUT;

	//Create Variable of enum type
	Error_Status I2CErrorStatus =0;

