vermashobhit1994/Embedded-System-Software/IoT_Based_Health_Monitoring_System/stm32f44xx_driver_Layer1/Src/stm32f44xx_i2c_driver.c
	//step1. Generate the start condition
	I2C_GenerateStartCondition(pI2CHandle -> pI2Cx);

	/******** After Step 2 and step 3 the SB bit is cleared *******/
	//step 2. Confirm that start condition is generated or not by checking the SB bit of I2C_SR1 Register.
	//SCL will be low until SB = 1 condition isn't met .
	//SB bit is 1 when start condition is generated successfully.
	while(!I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_SB))
	{
		//keep on waiting if timeout occurs i.e reach to 0 then ON the timeout LED
		if(!(--timeout) )
		{
			Error_Handler(STATUS_TIMEOUT);
			I2CErrorStatus = STATUS_TIMEOUT;
			return I2CErrorStatus;
		}
	}

	//Here to clear SB bit Read SR1 register then write into DR register

	//step 3: send address of slave with read/write bit = 0 (to write slave address)
	I2C_ExecuteAddressPhase(pI2CHandle -> pI2Cx,SlaveAddr,I2C_MASTER_TRANSMITTER);

    /********************************** SB Bit in I2C_SR1 Register is cleared ************************/

	timeout = I2C_MASTER_TIMOUT;

	//step 4: check the ADDR bit in I2C_SR1 Register to confirm address phase completed or not.
	//i.e address has been successfully transmitted.
	while(!I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_ADDR)  )//wait until it return 1
	{
		//keep on waiting if timeout occurs i.e reach to 0  then ON the error LED i.e peripheral isn't connected
		if(!(--timeout) )
		{
			Error_Handler(STATUS_ERROR);
			I2CErrorStatus = STATUS_ERROR;
			return I2CErrorStatus;

		}

	}

	//to clear the ADDR flag read SR1 register followed by read to SR2 Register

	//step 5: clear the ADDR bit in I2C_SR1 Register
	//until this is cleared SCL will be low.
	I2C_ClearADDRFlag(pI2CHandle -> pI2Cx );
   /************************** After this the ADDR bit is cleared i.e
    * address has been transferred successfully*********************/

	/*Now master can decide whether to enter into transmitter or receiver
	 mode (i.e to transmit or receive data from slave)
	 and depend on LSB bit in slave address sent */

    //step 6: Send the data 1 byte at a time to DR register.
     while(len > 0)
     {
    	 timeout = I2C_MASTER_TIMOUT;

    	 //TXE = 1 indicate the shift and DR register is empty so we can write data.
    	 while( !I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_TXE))//wait until TXE becomes zero
    	 {
    		//keep on waiting if timeout occurs i.e reach to 0 then ON the timeout LED
			if(!(--timeout) )
			{
				Error_Handler(STATUS_TIMEOUT);
				I2CErrorStatus = STATUS_TIMEOUT;
				return I2CErrorStatus;

			}
    	 }
    	 //putting the data from user pointer in I2C_DR Register with 1 byte at a time.
    	 //for second, third .... byte DR becomes empty but shift register isn't empty and at that time
    	 //writing of data in DR can be done.
    	 pI2CHandle -> pI2Cx ->I2C_DR =  *pTxBuffer;
    	 pTxBuffer++;//to point to next byte data.
    	 len--;
     }

     //step 7: Wait until BTF and TXE is set in I2C_SR1 Register.
	 //when both BTF and TXE is set i.e both SR and DR is empty so next transmission should begin.
	 //when BTF = 1 SCL clock is stretched.
     /*
     If the TXE = 1 and data isn't written before the last data byte data
     transmission then BTF is set and it's cleared by Writing Data to DR register
     and until then SCL clock is stretch to low.
	`*/
     timeout = I2C_MASTER_TIMOUT;
	 while( !I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_TXE))//wait until TXE is set
	 {
	    //keep on waiting if timeout occurs i.e reach to 0 then ON the timeout LED
		if(!(--timeout) )
		{
			Error_Handler(STATUS_TIMEOUT);
			I2CErrorStatus = STATUS_TIMEOUT;
			return I2CErrorStatus;

		}
	 }

     timeout = I2C_MASTER_TIMOUT;
     while(!I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_BTF))//wait until BTF is set.
     {
    	 //keep on waiting if timeout occurs i.e reach to 0 then ON the timeout LED
    	 if(!(--timeout) )
    	 {
    		 Error_Handler(STATUS_TIMEOUT);
    		 I2CErrorStatus = STATUS_TIMEOUT;
    		 return I2CErrorStatus;

    	 }
     }


	 //step 8: Generate stop condition.
	 //clear the BTF flag automatically
     if(RepeatStartConditionCtrl != REPEATE_START_CONDITION_DISABLE)
     {
    	 I2C_GenerateStopCondition(pI2CHandle -> pI2Cx);
     }

     I2CErrorStatus = STATUS_OK;

	 return I2CErrorStatus;
}

/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_MasterReceiveData
 * @brief                        : Function to receive the data via the I2C.
 * @param[in]                    : Base address of the I2C Handle structure .
 *@param[in]                     : Pointer to RxBuffer to store the data received
 *@param[in]                     : No of bytes of user buffer.
 *@param[in]                     : SlaveAddress.
 * @return                       : None
 * Special Note                  : Received Data stored in pRxBuffer
 */
Error_Status I2C_MasterReceiveData(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer,uint32_t maxlen,uint8_t SlaveAddr)
{
	//timeout value when status bit checking isn't done
	uint32_t timeout = I2C_MASTER_TIMOUT;

	//Create Variable of enum type
	Error_Status I2CErrorStatus =0;

	//step1. Generate the start condition
	//api private to driver.
	I2C_GenerateStartCondition(pI2CHandle -> pI2Cx);

	/******** After Step 2 and step 3 the SB bit is cleared *******/
		//step 2. Confirm that start condition is generated or not by checking the SB bit of I2C_SR1 Register.
		//SCL will be low until SB = 1 condition isn't met .
		//SB bit is 1 when start condition is generated successfully.
		while(!I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_SB))
		{
			//keep on waiting if timeout occurs i.e reach to 0 then ON the timeout LED
			 if(!(--timeout) )
			 {
				 Error_Handler(STATUS_TIMEOUT);
				 I2CErrorStatus = STATUS_TIMEOUT;
				 return I2CErrorStatus;

			 }
		}

		//step 3: send address of slave with read/write bit = 0 (to write)
		I2C_ExecuteAddressPhase(pI2CHandle -> pI2Cx,SlaveAddr,I2C_MASTER_RECEIVER);

	/********************************** SB Bit in I2C_SR1 Register is cleared ************************/

