vermashobhit1994/Embedded-System-Software/IoT_Based_Health_Monitoring_System/stm32f44xx_driver_Layer1/Src/stm32f44xx_i2c_driver.c
		timeout = I2C_MASTER_TIMOUT;//Init again
	//step 4: wait until the ADDR bit in I2C_SR1 Register to confirm address phase completed or not.
	while(!I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_ADDR)  )//wait until it return 1
	{
		//keep on waiting if timeout occurs i.e reach to 0 then ON the timeout LED
		 if(!(--timeout) )
		 {
			 Error_Handler(STATUS_TIMEOUT);
			 I2CErrorStatus = STATUS_TIMEOUT;
			 return I2CErrorStatus;

		 }
	}
	//step 5 : Read the data

			//for receiving the ACK must be disable first before clearing ADDR flag.
	    //and after that upon receiving data stop condition is generated
		//step 5a: Reading 1 byte of data
		if(maxlen == 1)
		{
			//Step 5a1 : disable the ACK
	    	(pI2CHandle -> pI2Cx ->I2C_CR[0]) &= ~(1 << I2C_CR1_ACK);

	    	//Step 5a2 : Clear the ADDR flag(as seen in timing diagram)
	    	I2C_ClearADDRFlag(pI2CHandle -> pI2Cx );

	    	//Step 5a3 : Generate stop condition
	    	I2C_GenerateStopCondition(pI2CHandle -> pI2Cx);



	    	timeout = I2C_MASTER_TIMOUT;

	    	//Step 5a4 : Wait until RxNE becomes 1 so as to confirm data has been received or not.
	    	while( !I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_RxNE))
	    	{
	    		//keep on waiting if timeout occurs i.e reach to 0 then ON the timeout LED
				 if(!(--timeout) )
				 {
					 Error_Handler(STATUS_TIMEOUT);
					 I2CErrorStatus = STATUS_TIMEOUT;
					 return I2CErrorStatus;

				 }
	    	}



	    	//clearing the RXNE flag by reading DR register.
	    	//Step 5a5 : Read the 1 byte data
			 //putting the data from user pointer in I2C_DR Register
	    	 *pRxBuffer = pI2CHandle -> pI2Cx ->I2C_DR ;

		}

		/*
		//Step 5b: Read 2 byte data
		else if(maxlen == 2)
		{
			//set ACK low
			(pI2CHandle -> pI2Cx ->I2C_CR[0]) &= ~(1 << I2C_CR1_ACK);

			//clear ADDR flag
			I2C_ClearADDRFlag(pI2CHandle -> pI2Cx );

			//wait until the BTF  = 1
			//Here DATA1 is in DR and data2 is in shift register
			while(!I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_BTF));

			//generate the stop condition
			I2C_GenerateStopCondition(pI2CHandle -> pI2Cx);

			//Read Data1 and DAta2
			*pRxBuffer++ = pI2CHandle-> pI2Cx-> I2C_DR;
			*pRxBuffer = pI2CHandle-> pI2Cx-> I2C_DR;

		}

		else
		{

		}

		*/
		//Step 5b: Read >1 byte of data
		 /*Note : To generate the NACK pulse after the last received data byte, the ACK bit
		              must be cleared just after reading the second last data byte
		*/


		if(maxlen > 1)
		{
			//Step 5b1 : clear the ADDR flag for EV6 event
			I2C_ClearADDRFlag(pI2CHandle -> pI2Cx );

			//Step 5b1 : disable the ACK
			//(pI2CHandle -> pI2Cx ->I2C_CR[0]) &= ~(1 << I2C_CR1_ACK);



			//Step 5b2 : Read the data until the len becomes 0
			for(uint32_t i = maxlen;i>0;i--)
			{
				timeout = I2C_MASTER_TIMOUT;

				//Step 5b3 : Wait until the RxNE becomes 1
				while( !I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_RxNE))
				{
					//keep on waiting if timeout occurs i.e reach to 0 then ON the timeout LED
					 if(!(--timeout) )
					 {
						 Error_Handler(STATUS_TIMEOUT);
						 I2CErrorStatus = STATUS_TIMEOUT;
						 return I2CErrorStatus;

					 }
				}

				//Step 5b4 : if last 2 bytes are remaining
				if(i == 2)
				{
					//clear the ACK bit
					(pI2CHandle -> pI2Cx ->I2C_CR[0]) &= ~(1 << I2C_CR1_ACK);

					//generate STOP condition
					I2C_GenerateStopCondition(pI2CHandle -> pI2Cx);


				}

				//Step 5b5 : Read the data from data register into user buffer
				//           To clear the RXNE flag i.e for EV7 event
				*pRxBuffer = pI2CHandle -> pI2Cx ->I2C_DR ;

				//Step 5b6 : Increment the user buffer address
				pRxBuffer++;
			}
		}

		//re-enable the ACK if user specified it for first time
		if(pI2CHandle -> I2C_Config.I2C_ACKCtrl == I2C_ACK_EN)
			(pI2CHandle -> pI2Cx ->I2C_CR[0]) |= (1 << I2C_CR1_ACK);


		return STATUS_OK;


}


/****************************** INterrupt Related API's *******************/
/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_IRQInterruptConfig
 * @brief                        :
 * @param[in]                    :
 *@param[in]                     :
 * @return                       : None
 * Special Note                  : None
 */
void I2C_IRQInterruptConfig(uint8_t IRQNumber, uint8_t ENOrDI)//to configure the Interrupt i.e IRQ no of I2C
{
	/* Configurations for the Interrupt Set Enable Register(ISER)*/
		if(ENOrDI == ENABLE)//if the Interrupt is enable
		{
			//select the IRQ No range
			if(IRQNumber <= 31)//since each register is of 32 bit size
			{
				//code for ISER0 Register
				//putting the IRQNumber in NVIC_ISER0 Register
				(*NVIC_ISER0_BASE_ADDR) |= (1<<IRQNumber);
			}
			else if(IRQNumber > 31 && IRQNumber <64)//for getting the next IRQNumber add 32.
			{
				//code for ISER1Register
				/*putting the IRQNumber in NVIC_ISER0 Register.
				 * Since to select the particular register we modulus(%) by 32 since each register is of 32 bit size*/
				(*NVIC_ISER1_BASE_ADDR) |= (1<<(IRQNumber % 32) );
			}
			else if(IRQNumber >= 64 && IRQNumber <96)//for getting the next IRQNumber add 32
			{
				//code for ISER2 Register
				//putting the IRQNumber in NVIC_ISER0 Register
				(*NVIC_ISER2_BASE_ADDR) |= (1<<(IRQNumber  % 64));
			}
		}

		else //configurations for the ICER(Interrupt Clear Enable Register) Register to disable the interrupt
		{
				//select the IRQ No range
				if(IRQNumber <= 31)//since each register is of 32 bit size
				{
					//code for ICER0 Register
					//putting the IRQNumber in NVIC_ISER0 Register
					*NVIC_ICER0_BASE_ADDR |= (1<<(IRQNumber ));
				}
				else if(IRQNumber > 31 && IRQNumber <64)//for getting the next IRQNumber add 32.
				{
					//code for ICER1Register
					//putting the IRQNumber in NVIC_ISER0 Register
					(*NVIC_ICER1_BASE_ADDR) |= (1<<(IRQNumber % 32) );
				}
				else if(IRQNumber >= 64 && IRQNumber <96)//for getting the next IRQNumber add 32
				{
					//code for ICER2 Register
					//putting the IRQNumber in NVIC_ISER0 Register
					(*NVIC_ICER2_BASE_ADDR) |= (1<<(IRQNumber % 64));
				}

