vermashobhit1994/Embedded-System-Software/IoT_Based_Health_Monitoring_System/stm32f44xx_driver_Layer1/Src/stm32f44xx_i2c_driver.c
		}

}


/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_IRQPriorityConfig
 * @brief                        :
 * @param[in]                    :
 *@param[in]                     :
 * @return                       : None
 * Special Note                  : None
 */

void I2C_IRQPriorityConfig(uint8_t IRQNumber,uint32_t IRQPriority)//to configure the priority of I2C
{
	//Step 1. Select the IPRx Register
		uint8_t iprx = IRQNumber / 4;
		//select the section from a particular iprx register
		uint8_t iprx_section = IRQNumber % 4;
		/*Here *4 since to shift the iprx register base address by 4
		 * Here *8 to access that particular bit in iprx register
		 * NO_OF_PRIORITY_BITS_IMPLEMENTED is depend on processor and 8- for select the high 4 bits in priority
		 * since the lower bits aren't implemented in each priority field	*/
		uint8_t shift_amt = (8 * iprx_section) + (8 - NO_OF_PRIORITY_BITS_IMPLEMENTED);
		//NOTE: In NVIC Register lower 8 bits isn't implemented so max value is 15
		*(NVIC_PR_BASE_ADDR + (iprx  )) |= (IRQPriority <<  shift_amt);

}






/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_PeripheralControl
 * @brief                        : Function to enable the I2C Peripheral.
 * @param[in]                    : Base address of the I2C Register structure .
 *@param[in]                     : Enable or Disable .
 * @return                       : None
 * Special Note                  : None
 */
void I2C_PeripheralControl(I2C_RegDef_t *pI2Cx,uint8_t EnOrDi)
{
	if(EnOrDi == ENABLE)//enable the I2C Peripheral
	{
		pI2Cx -> I2C_CR[0] |= (1<<I2C_CR1_PE);//enable the PE bit of I2C_CR1 Register

	}
		else//disable the SPI Peripheral.
			pI2Cx -> I2C_CR[0] &= ~(1<<I2C_CR1_PE);//disables the I2C bit of I2C_CR1 Register
}



/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_MasterSendData_Interrupt
 * @brief                        : Send the data to slave via the interrupt
 * @param[in]                    : Address of handle structure.
 * @param[in]                    :
 * @param[in]                    :
 * @param[in]                    :
 * @return                       : None
 * Special Note                  : None
 */
uint8_t I2C_MasterSendData_Interrupt(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer,uint32_t len,uint8_t SlaveAddr,uint8_t SrValue)
{
	//Getting the state whether it is transmitting or receiving.
	uint8_t busystate = pI2CHandle->TxRxState;

		if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX))
		{
			pI2CHandle->pTxBuffer = pTxBuffer;
			pI2CHandle->TxLen = len;
			pI2CHandle->TxRxState = I2C_BUSY_IN_TX ;
			pI2CHandle->DevAddr = SlaveAddr;
			pI2CHandle->SrValue = SrValue;

			/*************** First generate the start condition and then enable
			 *  the bit to enable the interrupt for event and error.
			 */
			//Implement code to Generate START Condition
			I2C_GenerateStartCondition(pI2CHandle -> pI2Cx);

			//Implement the code to enable ITBUFEN Control Bit
			pI2CHandle->pI2Cx->I2C_CR[1] |= ( 1 << I2C_CR2_ITBUFEN);

			//Implement the code to enable ITEVTEN Control Bit
			pI2CHandle->pI2Cx->I2C_CR[1] |= ( 1 << I2C_CR2_ITEVTEN);

			//Implement the code to enable ITERREN Control Bit
			pI2CHandle->pI2Cx->I2C_CR[1] |= ( 1 << I2C_CR2_ITERREN);

		}

		return busystate;


}


/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_MasterReceiveData_Interrupt
 * @brief                        :
 * @param[in]                    :
 *@param[in]
 *@param[in]
 *@param[in]                     :
 * @return                       : None
 * Special Note                  : None
 */

uint8_t I2C_MasterReceiveData_Interrupt(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer,uint32_t len,uint8_t SlaveAddr,uint8_t SrValue)
{
	//Getting the state whether it is transmitting or receiving.
	uint8_t busystate = pI2CHandle->TxRxState;

		if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX))
		{
			pI2CHandle->pTxBuffer = pRxBuffer;
			pI2CHandle->TxLen = len;
			pI2CHandle->TxRxState = I2C_BUSY_IN_RX ;
			pI2CHandle->DevAddr = SlaveAddr;
			pI2CHandle->SrValue = SrValue;

			//Implement code to Generate START Condition
			I2C_GenerateStartCondition(pI2CHandle -> pI2Cx);

			//Implement the code to enable ITBUFEN Control Bit
			pI2CHandle->pI2Cx->I2C_CR[1] |= ( 1 << I2C_CR2_ITBUFEN);

			//Implement the code to enable ITEVTEN Control Bit
			pI2CHandle->pI2Cx->I2C_CR[1] |= ( 1 << I2C_CR2_ITEVTEN);

			//Implement the code to enable ITERREN Control Bit
			pI2CHandle->pI2Cx->I2C_CR[1] |= ( 1 << I2C_CR2_ITERREN);

		}

		return busystate;

}

/* *********************************Documentation Section **********************************************
 * @fn                           :
 * @brief                        :
 * @param[in]                    :
 * @return                       : None
 * Special Note                  :
 */
static void I2C_CloseSendData(I2C_Handle_t *pI2CHandle)
{
	//disable the Tx and Rx interrupts events
	pI2CHandle -> pI2Cx -> I2C_CR[1] &= ~( 1 << I2C_CR2_ITBUFEN);

	//disable the event interrupt
	pI2CHandle -> pI2Cx -> I2C_CR[1] &=  ~(1 << I2C_CR2_ITEVTEN);

	pI2CHandle -> TxLen = 0;
	pI2CHandle -> pTxBuffer = NULL;
	pI2CHandle -> TxRxState = I2C_READY;

}

/* *********************************Documentation Section **********************************************
 * @fn                           :
 * @brief                        :
 * @param[in]                    :
 * @return                       : None
 * Special Note                  :
 */

static void I2C_CloseReceivedData( I2C_Handle_t *pI2CHandle)
{
	//disable the Tx and Rx interrupts events
	pI2CHandle -> pI2Cx -> I2C_CR[1] &= ~( 1 << I2C_CR2_ITBUFEN);

	//disable the event interrupt
	pI2CHandle -> pI2Cx -> I2C_CR[1] &=  ~(1 << I2C_CR2_ITEVTEN);

