vermashobhit1994/Embedded-System-Software/IoT_Based_Health_Monitoring_System/stm32f44xx_driver_Layer1/Src/stm32f44xx_i2c_driver.c
	pI2CHandle -> RxLen = 0;
	pI2CHandle ->TxRxState = I2C_READY;//change the state to ready state
	pI2CHandle -> pRxBuffer = NULL;//buffer is NULL
	pI2CHandle -> RxSize = 0;
	//enable the ACK if ACK is enabled
	if(pI2CHandle ->pI2Cx -> I2C_CR[0] & (1 << I2C_CR1_ACK))
		pI2CHandle ->pI2Cx -> I2C_CR[0] |= (1 << I2C_CR1_ACK);
}


__attribute__((weak))void I2C_ApplicationEventCallback(I2C_Handle_t *pI2CHandle, uint8_t AppEv)
{

}

/* *********************************Documentation Section **********************************************
 * @fn                           :
 * @brief                        :
 * @param[in]                    :
 * @return                       : None
 * Special Note                  :
 */

void I2C_MasterHandleRXNEInterrupt(I2C_Handle_t *pI2CHandle)
{
	//if 1 byte of data is there to be received
		if(pI2CHandle -> RxSize == 1)
		{
			//read the DR and store in RxBuffer
			*(pI2CHandle -> pRxBuffer) = pI2CHandle -> pI2Cx ->I2C_DR;
			//decrement length
			pI2CHandle -> RxLen--;

		}

		//if Received data length > 1
		else if(pI2CHandle -> RxSize > 1)
		{
			if(pI2CHandle ->RxLen == 2)
			{
				//clear ACK bit
				pI2CHandle -> pI2Cx -> I2C_CR[0] &= (1 << I2C_CR1_ACK);
			}

			//read DR
			*(pI2CHandle -> pRxBuffer) = pI2CHandle -> pI2Cx ->I2C_DR;
			pI2CHandle -> pRxBuffer++;//increment the pointer.
			//decrement length
			pI2CHandle -> RxLen--;
		}

		//if all data has been received
		else if(pI2CHandle -> RxSize   == 0)
		{
			//close the Rx reception and notfiy application

			//1. Generate STOP condition
			I2C_GenerateStopCondition(pI2CHandle -> pI2Cx);

			//2. Close the I2C Rx
			I2C_CloseReceivedData(pI2CHandle);

			//3. Notify the application
			I2C_ApplicationEventCallback(pI2CHandle, I2C_EVENT_RX_COMPLETE);
		}


}

/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_MasterHandleTXEInterrupt
 * @brief                        : Helper function to handle the TX interrupt
 * @param[in]                    :
 * @return                       : None
 * Special Note                  :
 */
void I2C_MasterHandleTXEInterrupt(I2C_Handle_t *pI2CHandle)
{
	//TxE bit is set i.e DR register is empty then transmit the data
	if(pI2CHandle -> TxRxState == I2C_BUSY_IN_TX)
	{
		//if data is there to be sent
		if(pI2CHandle -> TxLen > 0)
		{
			//1. Load the data in DR from TxBuffer
			pI2CHandle ->pI2Cx ->I2C_DR  = *(pI2CHandle -> pTxBuffer);

			//2. Decrement Tx length
			(pI2CHandle -> TxLen)--;

			//3. Increment buffer address to point to next byte.
			(pI2CHandle -> pTxBuffer)++;
		}
	}

}


/* *********************************Documentation Section **********************************************
 * @fn                           : I2C_EVENT_IRQHandling
 * @brief                        : Interrupt handling for both the master and slave mode of device whenever event occurs.
 * @param[in]                    : Address of handle structure.
 * @return                       : None
 * Special Note                  : This is common for both the master and slave mode interrupt handling.
 */
void I2C_EVENT_IRQHandling(I2C_Handle_t *pI2CHandle)
{
	//Interrupt handle for various events
	//getting the status of ITEVTEN bit in temp1 to find out whether event interrupt is enabled or not.
	uint32_t temp1 = pI2CHandle -> pI2Cx -> I2C_CR[1] & (1 << I2C_CR2_ITEVTEN);
	/*getting the status of ITBUFEN bit to find out whether interrupt event is generated when tx
	/buffer is empty or Rx buffer is filled with data.*/
	uint32_t temp2 = pI2CHandle -> pI2Cx -> I2C_CR[1] & (1 << I2C_CR2_ITBUFEN);


	//1. Handling interrupt event generated by SB event and done in Master mode only.
	//getting the status of SB bit in temp3
	uint32_t temp3 = pI2CHandle -> pI2Cx -> I2C_SR[0] & (1 << I2C_SR1_SB);
	//if interrupt is enabled and SB value is +ve then SB is set and execute the address phase.
	if(temp1 && temp3 )
	{
		//Interrupt is generated by SB event
		//Generated only in Master mode. For slave mode always 0
		/*Start condition generated and then we handle the address phase
		 i.e Writing the slave address */
		if(pI2CHandle -> TxRxState == I2C_BUSY_IN_TX)
			I2C_ExecuteAddressPhase(pI2CHandle -> pI2Cx, pI2CHandle ->DevAddr,0 );//0 means write data

		//1 means make the master to read the data by first writing the slave address
		else if (pI2CHandle -> TxRxState == I2C_BUSY_IN_RX)
			I2C_ExecuteAddressPhase(pI2CHandle -> pI2Cx, pI2CHandle ->DevAddr,1 );

	}

	//2. Handling interrupt event generated by ADDR event
	//for master mode -> Address is sent.
	//for slave mode -> Address is matched with Own address in I2C_OARx register
	temp3 = pI2CHandle -> pI2Cx -> I2C_SR[0] & (1 << I2C_SR1_ADDR);
	//if interrupt is enabled and ADDR value is +ve then ADDR bit is set
	if(temp1 && temp3 )
	{
		//ADDR bit is set then clear it since clock may be stretch to low.
		I2C_ClearADDRFlagInterrupt(pI2CHandle );



	}


	//3. Handling interrupt event generated by BTF(byte transfer finished) event
	temp3 = pI2CHandle -> pI2Cx -> I2C_SR[0] & (1 << I2C_SR1_BTF);
	//if interrupt is enabled and BTF value is +ve then BTF bit is set
	if(temp1 && temp3 )
	{
		//BTF bit is set
		//check for event i.e Rx or Tx
		if(pI2CHandle -> TxRxState == I2C_BUSY_IN_TX)
		{
			//check the TXE flag i.e Tx buffer is empty
			if(pI2CHandle -> pI2Cx -> I2C_SR[0] & (1 << I2C_SR1_TXE))
			{
				//BTF = 1, TXE = 1 i.e close the data transmission
				//close the communication only when length is 0 i.e all data has been sent.
				if(pI2CHandle -> TxLen == 0)
				{
					//1. Generate the stop condition only if repeated start is disabled
					if(pI2CHandle -> SrValue == I2C_DISABLE_SR)//get macro from @I2C Repeated Start
						I2C_GenerateStopCondition(pI2CHandle -> pI2Cx);

					//2. Reset all member elements of handle structure
					I2C_CloseSendData(pI2CHandle);

					//3. Notify the application for transmission complete
					I2C_ApplicationEventCallback(pI2CHandle, I2C_EVENT_TX_COMPLETE);
				}
			}
		}
		//if state is receive
		else if(pI2CHandle -> TxRxState == I2C_BUSY_IN_RX)
		{
			;
		}
	}


	//4. Handling interrupt event generated by STOPF event
	//applicable only when device is in slave mode.
	temp3 = pI2CHandle -> pI2Cx -> I2C_SR[0] & (1 << I2C_SR1_STOPF);
	//if interrupt is enabled and STOPF value is +ve then STOPF bit is set
	if(temp1 && temp3 )
	{
		//if STOPF bit is set then clear it
		pI2CHandle -> pI2Cx -> I2C_CR[1] |= (0x0000);
		//Handle the STOPF event.
		I2C_ApplicationEventCallback(pI2CHandle, I2C_EVENT_STOPF);
	}

	//5. Handling interrupt event generated by TxE event
	//generated when ITEVFEN and ITBUFEN bit are set.
	temp3 = pI2CHandle -> pI2Cx -> I2C_SR[0] & (1 << I2C_SR1_TXE);
	//if interrupt is enabled and TxE value is +ve then TxE bit is set
	if(temp1 && temp2 && temp3 )
	{
		//Handle the TxE event only if device is in master mode
		if(pI2CHandle ->pI2Cx ->I2C_SR[1] & (1 << I2C_SR2_MSL))
		{
			I2C_MasterHandleTXEInterrupt(pI2CHandle);
		}
	}


	//6. Handling interrupt event generated by RxNE event
	//generated when ITEVFEN and ITBUFEN bit are set.
	temp3 = pI2CHandle -> pI2Cx -> I2C_SR[0] & (1 << I2C_SR1_RXNE);
	//if interrupt is enabled and RxNE value is +ve then RxNE bit is set
	if(temp1 && temp2 && temp3 )
	{
		//RxNE bit is set
		//RxNE bit is set i.e DR register is filled with received data.
		/********works only if device is in master mode  */
		if(pI2CHandle -> pI2Cx -> I2C_SR[1] & (1 << I2C_SR2_MSL))
		{
			if(pI2CHandle -> TxRxState == I2C_BUSY_IN_RX)
			{
				I2C_MasterHandleRXNEInterrupt(pI2CHandle);
			}
		}
	}


